Комплексная_автоматизация_2_МОМ_2019/src/AccumulationRegisters/ДвиженияНоменклатураНоменклатура/ДвиженияНоменклатураНоменклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияНоменклатураНоменклатура</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КорКоличество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьЗабалансовая</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьЗабалансоваяРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДопРасходы</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДопРасходыБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДопРасходыУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДопРасходыРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПостоянныеСНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПостоянныеБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПостоянныеУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПостоянныеРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Трудозатраты</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ТрудозатратыУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ТрудозатратыРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПеременныеСНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПеременныеБезНДС</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПеременныеУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостатейныеПеременныеРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ПостояннаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ВременнаяРазница</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ИсточникГФУНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорИсточникГФУНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументДвижения</name>
    <type>
      <types>DocumentRef.ВнутреннееПотреблениеТоваров</types>
      <types>DocumentRef.ПеремещениеМатериаловВПроизводстве</types>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПередачаТоваровХранителю</types>
      <types>DocumentRef.ПередачаСырьяПереработчику</types>
      <types>DocumentRef.КорректировкаНазначенияТоваров</types>
      <types>DocumentRef.ПересортицаТоваров</types>
      <types>DocumentRef.ВозвратСырьяОтПереработчика</types>
      <types>DocumentRef.ВыпускПродукции</types>
      <types>DocumentRef.ВозвратТоваровМеждуОрганизациями</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ИсправлениеРазвернутогоСальдоТоваровОрганизаций</types>
      <types>DocumentRef.ВозвратМатериаловИзПроизводства</types>
      <types>DocumentRef.ПередачаТоваровМеждуОрганизациями</types>
      <types>DocumentRef.РасчетСебестоимостиТоваров</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
      <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
      <types>DocumentRef.ПорчаТоваров</types>
      <types>DocumentRef.ПоступлениеОтПереработчика</types>
    </type>
  </attributes>
  <attributes>
    <name>КорОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетСебестоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗапасов</name>
    <type>
      <types>EnumRef.ТипыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорНаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорАналитикаУчетаНоменклатуры</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорСклад</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорТипЗапасов</name>
    <type>
      <types>EnumRef.ТипыЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КорВидЗапасов</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Комплексная_автоматизация_2_МОМ_2019/src/AccumulationRegisters/ДвиженияНоменклатураНоменклатура/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//++ НЕ УТ
#Область ПрограммныйИнтерфейс


// Определяет показатели регистра.
// Подробнее см. ОбщийМодуль.МеждународныйУчетСерверПовтИсп.Показатели().
//
// Параметры:
//  Свойства - Структура - содержащая ключи СвойстваПоказателей, СвойстваРесурсов.
//
// Возвращаемое значение:
//  Соответствие - Ключ - имя показателя.
//                 Значение - структура свойств показателя.
//
Функция Показатели(Свойства) Экспорт

	Показатели = Новый Соответствие;
	
	СвойстваПоказателей = Свойства.СвойстваПоказателей;
	СвойстваРесурсов = Свойства.СвойстваРесурсов;
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СтоимостьУпр", "ВалютаУпр"));
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СтоимостьРегл", "ВалютаРегл"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.Сумма, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СтоимостьБезНДС", "ВалютаУпр"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаБезНДС, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	МассивРесурсов = Новый Массив;
	МассивРесурсов.Добавить(Новый Структура(СвойстваРесурсов, "СтоимостьРегл", "ВалютаРегл"));
	Показатели.Вставить(Перечисления.ПоказателиАналитическихРегистров.СуммаРегл, Новый Структура(СвойстваПоказателей, МассивРесурсов));
	
	Возврат Показатели;
	
КонецФункции

#КонецОбласти
//-- НЕ УТ

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

#КонецОбласти

#КонецЕсли
